{
"Neural Network / Deep Learning" : [
{
	"title" : "Deep Learning - Face Recognition using CNN",
	"year" : "March 2017 – March 2017",
	"desc" : "The python program that classifies and recognize input faces using Convoluitonal Neural Network with backward propagation to minimize error. It detected faces with 98% accuracy."
	},
	{
	"title" : "Neural Network - ADALINE network and LMS",
	"year" : "Oct 2016 – Oct 2016",
	"desc" : "The python program uses Adaptive linear neuron network to predict the future prices based on the continuous price input. The learning algorithm adjusts weights based on those input and tries to Minimise the error rate using Widrow Hoff Least Mean Square algorithm."
	},
	{
	"title" : "Neural Network - Pattern Recognition",
	"year" : "Sep 2016 – Sep 2016",
	"desc" : "The program uses variants of Hebbian learning Rule namely supervised, filtered and delta learning rule to learn the pattern of number digits and tries to recognies it."
	},
	{
	"title" : "Neural Network - Perceptron Learning Rule",
	"year" : "Sep 2016 – Sep 2016",
	"desc" : "The python program models the perceptron Learning Rule that classifies linearly separable data by adjusting the weight based on the data inputs."
	}
],
"Machine Learning" : [
    {
	"title" : "Naive Bayesian Text Classifier",
	"year" : "Sep 2015 – Sep 2015",
	"desc" : "A java program to classify the newsgroup for given test and training dataset using Naive Bayes Classification Algorithm. The code is capable of doing both in memory computation and file read computation. The classifier worked with 90% accuracy."
	},
	{
	"title" : "Face Recognition using K- NN",
	"year" : "Dec 2015 – Dec 2015",
	"desc" : "Matlab code that classifies and recognize input faces using Multiclass K-NN. . It detected faces with 90% accuracy on average. Resizing, PCA and LDA algorithm were used to reduce dimensionality of the input images."
	},
	{
	"title" : "Face Recognition using SVM Classifier",
	"year" : "Oct 2015 – Oct 2015",
	"desc" : "Matlab code that classifies and recognize input faces using Multiclass SVM. HOG was used to extract the image features. It detected faces with 90% accuracy on average."
	},
	{
	"title" : "Data Mining - Sentiment Analysis for Decision Making",
	"year" : "Feb 2014 – March 2014",
	"desc" : "This project aims at a detailed comparison of classifiers, especially based on their precision and recall metrics, for sentiment analysis pertaining to data mining of movie reviews. The classifiers we are took into account were the SVM classifier, the Naïve Bayesian classifier and the K-NN classifier."
	}	
],
"Cloud Computing" : [
	{
	"title" : "Cloud Computing - Google App Engine Scalable Services",
	"year" : "May 2015 – May 2015",
	"desc" : "Creating scalable web service for uploading files and viewing the files uploaded by users after authentication using Google App Engine."
	},
    {
	"title" : "Cloud Computing - Google App Engine",
	"year" : "May 2015 – May 2015",
	"desc" : "A simple website using php and Google App engine that allows the user to store their files in google cloud storage and also provides time to upload the file and its details that is stored in Google SQL."
	},
	{
	"title" : "Cloud Computing - Dataset Visualization Website",
	"year" : "Apr 2015 – Apr 2015",
	"desc" : "A website that shows the clustering for given dataset and user desired column using d3js and hosting in cloud using amazon elastic beanstalk"
	},
	{
	"title" : "Cloud Computing - E-Commerce Website",
	"year" : "Mar 2015 – Mar 2015",
	"desc" : "A simple E-Commerce website that gets the product list and its details from user, stores it in DynamoDB No SQL database in cloud and displays all items posted by all user to all user. Sorting and Filtering of items can also be done."
	},
	{
	"title" : "Cloud Computing - Hadoop MapReduce",
	"year" : "Mar 2015 – Mar 2015",
	"desc" : "Configured Hadoop on EC2 instance to generate data based on the conditions given by the user and use the final data for data visualization using R Studio."
	},
	{
	"title" : "Cloud Computing - AWS",
	"year" : "Feb 2015 – Feb 2015",
	"desc" : "Uploading files to AWS S3 using python and boto package. Loading data set into AWS RDS and computing time taken to run 2000 queries on the database using AWS EC2."
	},
	{
	"title" : "Cloud Computing - Secure upload",
	"year" : "Jan 2015 – Jan 2015",
	"desc" : "Using pycrypto package to encrypt the files to be uploaded in the dropbox and while downloading it will be decrypted. To sign and verify the athentication gnupg package is used."
	},
	{
	"title" : "Cloud Based Patient Health Record Management",
	"year" : "Feb 2014 – Feb 2014",
	"desc" : "Stores patients’ health record in the cloud storage. This record can be accessible by both the practitioner and the patient. E-prescriptions can also be generated by the doctor."
	}
],

"Computer Vision and Robotics" : [
    {
	"title" : "Robotics - Human Tracking Quadcopter in ROS and OpenTLD",
	"year" : "Apr 2015 – Apr 2015",
	"desc" : "Using ROS and OpenTLD, programmed Parrot 2.0 quadcopter to make it track the person or object. The parrot 2.0 learns the tracking object, its motion and follows the object even if there is obstacle.",
	"video" : "https://www.youtube.com/watch?v=_S8g2SBseOM"
	},
	{
	"title" : "Robotics - Motion Planning for EV3 Mindstorm",
	"year" : "Feb 2015 – Feb 2015",
	"desc" : "Writing Python code to make the EV3 Mindstorm Robot to plan its motion to reach the goal from start position in both static and dynamic environment. Robot also does exhaustive search to find goal in given dynamic environment even if the coordinate position of goal is not given."
	},
	{
	"title" : "Computer Vision - Edubot",
	"year" : "Nov 2014 – Dec 2014",
	"desc" : "This project was mainly focused on making the robot to teach the kids using Scratch. Kinect and EV3 Mindstorm was used along with Scratch 2.0 to create simple games that helps kids to learn interactively, the concept they study.",
	"video" : "https://www.youtube.com/watch?v=HpnTgeTvD_s"
	}
],
"Android" : [
	{
	"title" : "Android - Point to Point Measurement",
	"year" : "March 2016 – Apr 2016",
	"desc" : "An android application that helps user to measure distance between two points selected through camera preview. The measurement is calculated using RealSense camera and the app does internal tracking to track points when it goes out of frame."
	},
	{
	"title" : "Android - Remember Easy",
	"year" : "Feb 2016 – Feb 2016",
	"desc" : "An android application that manages all your account details, passwords, card details, email and other website accounts at an edge of only one passcode. This can be accessed in offline mode anywhere at anytime. The information are highly secured using AES Encryption. You can also Export and Import your details between different accounts."
	},
	{
	"title" : "NAGIRescue App and Website",
	"year" : "Oct 2015 – Oct 2015",
	"desc" : "An android application and website for NGO that provides user with easier guidance to take care of their Pets and also helps to find lost pet easily on the go. The app is capable to share the post in all the social media. (Second place in PayPal Opportunity Hackathon)"
	},
	{
	"title" : "Android - Study Room Assistance",
	"year" : "Jun 2015 – Jun 2015",
	"desc" : "An android application that allows student to reserve study rooms in the university library. Students can create a separate wishlist to add the rooms for tracking its availability for future reservation"
	}
],
"Web Development" : [
	{
	"title" : "Customized Search Engine",
	"year" : "Nov 2014 – Nov 2014",
	"desc" : "Customized search engine provides facilities for the user to search for information using various search engines like Google, Yahoo, Bing etc and also provides lockers to upload and download personal details like images, audio etc. anywhere at any time."
	},
	{
	"title" : "Cloud Based Patient Health Record Management",
	"year" : "Feb 2014 – Feb 2014",
	"desc" : "Stores patients’ health record in the cloud storage. This record can be accessible by both the practitioner and the patient. E-prescriptions can also be generated by the doctor."
	},
	{
	"title" : "Dynamic Virtual Keyboard",
	"year" : "Mar 2013 – Mar 2013",
	"desc" : "This dynamic keyboard obscures and randomizes keys so that the co-ordinates of each key cannot be determined thus preventing from key loggers."
	}
],
"Other" : [
	{
	"title" : "Algorithms - Analysis of Shortest Path Algorithms",
	"year" : "Nov 2014 – Dec 2014",
	"desc" : "A Java project to determine the shortest path from Source to Destination in various Algorithms such as Dijikstra's Algorithm, Bellman-Ford Algorithm, Floyd Warshall Algorithm and Johnson's Algorithm. This project successfully evaluated the shortest path when millions of nodes are given as input to these algorithms."
	}
]
}
